#### HasLeaderElbow Method

---

|  |
| --- |
| IndependentTag Class   See Also |

Whether the tag's leader that points to the reference has an elbow point or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool HasLeaderElbow( 	Reference referenceTagged ) ``` |

| Visual Basic |
| --- |
| ``` Public Function HasLeaderElbow ( _ 	referenceTagged As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasLeaderElbow( 	Reference^ referenceTagged ) ``` |

#### Parameters

referenceTagged
:   Type:  Autodesk.Revit.DB Reference

#### Return Value

True if the reference has a leader with an elbow point, or false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The specified reference is not currently tagged. -or- The leader for the tagged reference isn't visible. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IndependentTag Class

Autodesk.Revit.DB Namespace